#Написать программу получающую набор произведений чисел от 1 до N. Пример: пусть N = 4, тогда [ 1, 2, 6, 24 ]
N = int(input('Введите количество чисел: '))
list = []
prod = 1
for i in range(N):
    list.append((i+1)*prod)
    prod*=(i+1)
print(list)